import React from 'react';
import { useUser } from '../../../UserContext';
import GeneralHeader from '../../../components/GeneralComponents/GeneralComponents';
import Footer from '../../../components/Footer/Footer';
import './Terms.css';


export default function Terms() {
  return (
    <div className='terms'>
        <GeneralHeader {...useUser()} />
        <main>
            <h2 className='title'>1. ЗАГАЛЬНІ ПОЛОЖЕННЯ</h2>
            <div className='chapter'>
                <p><strong>1.1</strong> Ці Правила відповідно до Закону України «Про дорожній рух» встановлюють єдиний порядок дорожнього руху на всій території України. Інші нормативні акти, що стосуються особливостей дорожнього руху (перевезення спеціальних вантажів, експлуатація транс­портних засобів окремих видів, рух на закритій території тощо), повинні ґрунтуватися на вимогах цих Правил.</p>
            </div>
            <div className='chapter'>
                <p><strong>1.2</strong> В Україні установлено правосторонній рух транспортних засобів.</p>
                <img src='../img/handbooks/pdd1.jpg' width='900px'/>
            </div>
            <div className='chapter'>
                <p><strong>1.3</strong> Учасники дорожнього руху зобов'язані знати й неухильно виконувати вимоги цих Правил, а також бути взаємно ввічливими.</p>
            </div>
            <div className='chapter'>
                <p><strong>1.4</strong> Кожний учасник дорожнього руху має право розраховувати на те, що й інші учасники виконують ці Правила.</p>
            </div>
            <div className='chapter'>
                <p><strong>1.5</strong> Дії або бездіяльність учасників дорожнього руху та інших осіб не повинні створювати небезпеку чи перешкоду для руху, загрожувати життю або здоров'ю громадян, завдавати матеріальних збитків. Особа, яка створила такі умови, зобов'язана негайно вжити заходів до забезпечення безпеки дорожнього руху на цій ділянці дороги та вжити всіх можливих заходів до усунення перешкод, а якщо це неможливо, попередити про них інших учасників дорожнього руху, повідомити уповноважений підрозділ Національної поліції, власника дороги або уповноважений ним орган.</p>
                <img src='../img/handbooks/pdd2.jpg' width='900px'/>
                <img src='../img/handbooks/pdd3.jpg' width='900px'/>
            </div>
            <div className='chapter'>
                <p><strong>1.6</strong> Водії зобов’язані бути особливо уважними до таких категорій учасників дорожнього руху, як велосипедисти, особи, які рухаються в кріслах колісних, та пішоходи. Усі учасники дорожнього руху повинні бути особливо обережними до дітей, людей похилого віку та осіб з явними ознаками інвалідності.</p>
            </div>
            <div className='chapter'>
                <p><strong>1.7</strong> Обмеження в дорожньому русі, крім передбачених цими Правилами, можуть бути запроваджені в установленому законодавством порядку.</p>
            </div>
            <div className='chapter'>
                <p><strong>1.8</strong> Особи, які порушують ці Правила, несуть відповідальність згідно із законодавством.</p>
            </div>
        </main>
        <Footer />
    </div>
  )
}
